import { Ingredient } from "@/components/basic/recipe";

type CookBook = {
	name: string;
	slug: string;
	date: string;
	description: string;
	ingredients: Ingredient[];
	steps: string[];
};

export const cookbook: CookBook[] = [
	{
		name: "เลมอนเคิร์ด",
		slug: "lemon-curd",
		date: new Date("2024-06-03").toDateString(),
		description:
			"เลมอนเคิร์ด เป็นซอสลักษณะคล้ายคัสตาร์ด มีรสชาติออกเปรี้ยวหวานมีกลิ่นหอมอ่อนๆของเลมอนเป็นหลัก นิยมนำไปใช้ทาขนมปัง, แครกเกอร์ หรือเอาไปเป็นส่วนประกอบของขนมอื่นๆ เช่น คุกกี้ พายหรือทาร์ต",
		ingredients: [
			{ ingredient: "เนย", quantity: "70", units: "g" },
			{ ingredient: "เกลือ", quantity: "0.125", units: "tsp" },
			{ ingredient: "น้ำตาลทราย", quantity: "110", units: "g" },
			{ ingredient: "น้ำเลม่อน", quantity: "100", units: "ml" },
			{ ingredient: "ผิวเลม่อน", quantity: "2", units: "tbsp" },
			{ ingredient: "ไข่", quantity: "3", units: "unit" },
		],
		steps: [
			"นำผิวเลมอนขูดมาคลุกกับน้ำตาลทรายในอ่างผสมให้เข้ากันดี",
			"ทิ้งไว้ประมาณ 15 นาทีเพื่อให้น้ำมันหอมระเหยจากผิวเลมอนซึมเข้ากับน้ำตาล",
			"แยกไข่แดง 3 ฟอง และไข่ขาว 1 ฟองลงในอ่างผสมเดียวกัน (ตามสูตร)",
			"ใส่ผิวเลมอนและน้ำตาลที่คลุกไว้ลงในอ่างผสมที่มีไข่",
			"เติมน้ำเลมอนลงไป แล้วคนให้เข้ากัน",
			"ยกอ่างผสมวางบนหม้อน้ำเดือดอ่อนๆ (ทำการตุ๋น)",
			"ใช้ตะกร้อคนส่วนผสมอย่างต่อเนื่อง เพื่อป้องกันการเกิดเป็นก้อน",
			"คนจนส่วนผสมเริ่มข้นขึ้น (ใช้เวลาประมาณ 10-15 นาที)",
			"ใส่เนยจืดหั่นเป็นชิ้นเล็กๆ ลงไปในส่วนผสม คนจนเนยละลายและเข้ากันดีกับส่วนผสม",
		],
	},
];
